Repository: pheonixeye/erection_test
Catalog: assets/lang/app_*.arb
Languages: ar

source: Erection Test
ar: اختبار الانتصاب

source: Calculate Score
ar: حساب النتيجة

source: Questionnaire Incomplete
ar: برجاء اجابة كل الاسئلة

source: Questionnaire Reset
ar: تم اعادة الاختبار

source: Re-Take Test
ar: اعادة

# designedByKareemZaher
source: By Dr. Kareem Zaher
ar: تنفيذ د / كريم زاهر

# copyright
source: All Rights Reserved
ar: جميع الحقوق محفوظة

source: Home
ar: الرئيسية

source: Test
ar: الاختبار

source: About
ar: معلومات

source: Language
ar: اللغة

source: Theme
ar: الثمة

source: Begin Test
ar: بدء الاختبار

# introText
source: These questions ask about the effects that your erection problems have had on your sex life over the last four weeks. Please try to answer the questions as honestly and as clearly as you are able. Your answers will help your doctor to choose the most effective treatment suited to your condition.
ar: تسأل هذه الأسئلة عن تأثير مشاكل الانتصاب على حياتك الجنسية خلال الأسابيع الأربعة الماضية. يُرجى الإجابة بصدق ووضوح قدر الإمكان، فإجاباتك تساعد طبيبك في اختيار العلاج الأنسب لحالتك

# guidlinesTitle
source: Guidelines on Clinical Application of IIEF Patient Questionnaire
ar: إرشادات حول التطبيق السريري لاختبار الانتصاب

# guidlinesSubtitle
source: The 15-question IIEF questionnaire is a validated tool for assessing erectile dysfunction across 4 domains:
ar: يوفر الاستبيان تقييمًا موثوقًا لوظائف الرجل الجنسية عبر اربعة مجالات

# domainOne
source: Erectile function
ar: وظيفة الانتصاب

# domainTwo
source: Orgasmic function
ar: وظيفة النشوة

# domainThree
source: Sexual desire
ar: الرغبة الجنسية

# domainFour
source: Intercourse satisfaction
ar: الرضا أثناء الجماع

# guidelinesEnd
source: Mean scores in research show clear differences between healthy men and patients.
ar: تظهر النتائج في الأبحاث فروقًا واضحة بين الرجال الأصحاء والمرضى.

# clinicalApplications
source: Clinical application includes:
ar: تطبيقات سريرية:

# cAppOne
source: Low erectile function score → Trial of Sildenafil
ar: انخفاض واضح في مجال الانتصاب ← تجربة علاج سيلدينافيل

# cAppTwo
source: Primary orgasm/ejaculation disorder → Specialist referral
ar: مشاكل أساسية في القذف أو النشوة ← تحويل لطبيب متخصص

# cAppThree
source: Low desire → Check androgen & prolactin
ar: انخفاض الرغبة الجنسية ← فحص هرمون الذكورة والبرولاكتين

# cAppFour
source: Low satisfaction with moderate erectile dysfunction → Consider psychosexual counselling
ar: انخفاض الرضا مع مستوى متوسط من الضعف الجنسي ← التفكير في العلاج النفسي الجنسي

source: Definitions
ar: التعريفات

# defOne
source: Sexual activity includes intercourse, caressing, foreplay & masturbation
ar: النشاط الجنسي: يشمل الجماع، والمداعبة، والتمهيد الجنسي، والاستمناء

# defTwo
source: Sexual intercourse = sexual penetration of your partner
ar: الجماع: إيلاج القضيب في شريكك

# defThree
source: Sexual stimulation = situations such as foreplay, erotic pictures etc.
ar: التحفيز الجنسي: مثل المداعبة أو الصور المثيرة

# defFour
source: Ejaculation = ejection of semen from the penis (or the feeling of this)
ar: القذف: خروج السائل المنوي من القضيب أو الإحساس بذلك

# defFive
source: Orgasm = fulfilment or climax following sexual stimulation or intercourse
ar: النشوة الجنسية: الذروة أو الإشباع بعد التحفيز أو الجماع

# disclaimerTitle
source: Privacy Disclaimer
ar: إخلاء مسؤولية الخصوصية

# disclaimerP1
source: This website does not collect, store, or process any personal information from its users. We do not use cookies, tracking tools, analytics services, or any other technologies that collect data about your visit.
ar: هذا الموقع لا يجمع أو يخزن أو يعالج أي معلومات شخصية عن المستخدمين. لا نستخدم الكوكيز، أو أدوات التتبع، أو خدمات التحليلات، أو أي تقنيات أخرى تقوم بجمع بيانات عن زيارتك

# disclaimerP2
source: By using this website, you can be assured that your privacy is fully respected and protected.
ar: باستخدامك لهذا الموقع، يمكنك التأكد من أن خصوصيتك محفوظة بالكامل
